
<details><summary>Show Plan</summary>

``` terraform
terraform
module.aurora_database.module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=Wk_niQ]
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=4685552944474357529]
module.get_auth.module.lambda.null_resource.docker_build: Refreshing state... [id=6839291668835771310]
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=3941968502260631568]
module.get_sdk_status.module.lambda.null_resource.docker_build: Refreshing state... [id=897924848326367619]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk_analysis_logs: Refreshing state... [id=prod-sdk-analysis]
module.get_sdk_status.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-get_sdk_status]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=prod-sdk-analyzed]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_upload]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z00493513SFYX7KIRT3B6]
module.aurora_database.aws_rds_cluster_parameter_group.cluster_parameter_group: Refreshing state... [id=prod-mantarray-rds-cluster-parameter-group]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-026fcb64]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-1b3c4b56]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-queue-deadletter]
module.aurora_database.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-e0fc5ec1]
module.aurora_database.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-95c232e8]
module.api.aws_cognito_user_pool.lambda_gw_pool: Refreshing state... [id=us-east-1_nLTgeGIMQ]
module.api.aws_apigatewayv2_api.lambda_gw: Refreshing state... [id=ccr0ug0bj1]
module.api.aws_iam_role.iam_for_lambda: Refreshing state... [id=prod-iam-for-lambda]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio.com]
module.aurora_database.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-026fcb64]
module.sdk_status_db.aws_dynamodb_table.sdk_analysis_statuses: Refreshing state... [id=prod-sdk-analysis-statuses]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-e0fc5ec1]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:245339368379:certificate/6354ca50-99dc-4b91-a815-c1f3ca723df9]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_analysis]
module.get_auth.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-get_auth]
module.aurora_database.aws_db_parameter_group.parameter_group: Refreshing state... [id=prod-mantarray-rds-parameter-group]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-95c232e8]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-prod-server-access-logs]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=1797832498446893009]
module.get_sdk_status.module.lambda.null_resource.docker_tag: Refreshing state... [id=7143688318498075103]
module.api.aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/prod-lambda-gw]
module.api.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=prod-iam-for-lambda-20210924181509989400000001]
module.api.aws_cognito_user_pool_client.lambda_gw_pool_client: Refreshing state... [id=63egas596gqdt2fr4cabj4ujs2]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=7096115813722568909]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z00493513SFYX7KIRT3B6_a6a6hxwse7f7keb3h845_CNAME]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z00493513SFYX7KIRT3B6_www_CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_TXT]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_MX]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_A]
module.get_auth.module.lambda.null_resource.docker_tag: Refreshing state... [id=5014150205567169606]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=prod-sdk_analysis-execution-task-role]
module.aurora_database.module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=prod-mantarray-rds]
module.get_sdk_status.module.lambda.null_resource.docker_push: Refreshing state... [id=3274237696111683158]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=7846640611608649548]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio.com"]: Refreshing state... [id=Z00493513SFYX7KIRT3B6__cf8a73a02ed777d265f1e560422d8381.curibio.com._CNAME]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=8677901282653917602]
module.api.aws_apigatewayv2_authorizer.lambda_gw_auth: Refreshing state... [id=4r1yo8]
module.api.aws_apigatewayv2_stage.lambda_gw_stage: Refreshing state... [id=prod-lambda-gw-stage]
module.get_auth.module.lambda.null_resource.docker_push: Refreshing state... [id=3632371305803003695]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio.com]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=prod-sdk_analysis-execution-task-role-20210908162419459500000001]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=EQU24OD7P9BYZ]
module.aurora_database.module.db.aws_rds_cluster.this[0]: Refreshing state... [id=prod-mantarray-rds]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-sdk-upload-lambda]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-get-sdk-status]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-get-auth]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=prod-sdk_analysis-ecs_task_role]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-get-sdk-status-inline]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-get-auth]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-get-sdk-status]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-get-sdk-status-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-17 15:56:52 +0000 UTC]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_jupyter-sdk.curibio.com_CNAME]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.aurora_database.module.db.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=prod-mantarray-rds-one]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-get-auth]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=prod-sdk-upload-lambda-20210924181559497000000003]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-get-auth-logs]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-get-sdk-status]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=prod-get-sdk-status-20211108193836435200000001]
module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=prod-get-sdk-status-20211108193836451600000002]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=prod-sdk-upload-lambda-20210924181559297000000002]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=prod-sdk_analysis-ecs-task-definition]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1OSG2PRSZKP4F]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio.com]
module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service: Refreshing state... [id=arn:aws:ecs:us-east-1:245339368379:service/prod-sdk_analysis-cluster/prod-sdk_analysis-ecs-service]
module.sdk_analysis.module.lambda.aws_apigatewayv2_integration.lambda_api_integration: Refreshing state... [id=sz0fua9]
module.sdk_analysis.module.lambda.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowAPIInvoke]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=prod-get-auth-20210924181615886100000004]
module.get_auth.module.lambda.aws_apigatewayv2_integration.lambda_api_integration: Refreshing state... [id=amrgop1]
module.get_sdk_status.module.lambda.aws_apigatewayv2_integration.lambda_api_integration: Refreshing state... [id=8kqsto8]
module.get_sdk_status.module.lambda.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowAPIInvoke]
module.get_auth.module.lambda.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowAPIInvoke]
module.sdk_analysis.module.lambda.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=dtpd0v3]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_downloads.curibio.com_CNAME]
module.get_sdk_status.module.lambda.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=x7q6vw8]
module.get_auth.module.lambda.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=shqdxlf]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      ~ family          = "prod-sdk_analysis-ecs-task-definition" -> (known after apply)
      ~ id              = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:2" -> (known after apply)
      ~ network_mode    = "awsvpc" -> (known after apply)
      ~ revision        = 2 -> (known after apply)
      ~ status          = "ACTIVE" -> (known after apply)
      ~ task_role_arn   = "arn:aws:iam::245339368379:role/prod-sdk_analysis-ecs_task_role" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be updated in-place
  ~ resource "aws_ecs_service" "aws-ecs-service" {
        id                                 = "arn:aws:ecs:us-east-1:245339368379:service/prod-sdk_analysis-cluster/prod-sdk_analysis-ecs-service"
        name                               = "prod-sdk_analysis-ecs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:2" -> (known after apply)
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task must be replaced
-/+ resource "aws_ecs_task_definition" "aws-ecs-task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                      + {
                          + name  = "DB_CLUSTER_ENDPOINT"
                          + value = "prod-mantarray-rds.cluster-cykkmge5u6hv.us-east-1.rds.amazonaws.com"
                        },
                        {
                            name  = "S3_UPLOAD_BUCKET"
                            value = "prod-sdk-analyzed"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  - mountPoints      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "prod-sdk_analysis-ecs-task-definition" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_role" {
        id                    = "prod-sdk_analysis-ecs_task_role"
        name                  = "prod-sdk_analysis-ecs_task_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {
          - name   = "prod-sdk_analysis-ecs_inline_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "sqs:ReceiveMessage",
                              - "sqs:DeleteMessage",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:us-east-1:245339368379:prod-sdk-upload-queue"
                        },
                      - {
                          - Action   = [
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:ListBucket",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::prod-sdk-upload",
                              - "arn:aws:s3:::prod-sdk-upload/*",
                              - "arn:aws:s3:::prod-sdk-analyzed",
                              - "arn:aws:s3:::prod-sdk-analyzed/*",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                        },
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-east-1:245339368379:secret:db-creds-hdEvmn"
                        },
                      - {
                          - Action   = [
                              - "kms:*",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:kms:us-east-1:245339368379:key/8bab919b-343a-40a5-862e-d0febffcc3ab"
                        },
                      - {
                          - Action   = [
                              - "rds:DescribeDBClusterEndpoints",
                              - "rds:DescribeDBInstances",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:rds:us-east-1:077346344852:*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "prod-sdk_analysis-ecs_inline_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "sqs:ReceiveMessage",
                              + "sqs:DeleteMessage",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:sqs:us-east-1:245339368379:prod-sdk-upload-queue"
                        },
                      + {
                          + Action   = [
                              + "s3:GetObject",
                              + "s3:PutObject",
                              + "s3:ListBucket",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::prod-sdk-upload",
                              + "arn:aws:s3:::prod-sdk-upload/*",
                              + "arn:aws:s3:::prod-sdk-analyzed",
                              + "arn:aws:s3:::prod-sdk-analyzed/*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                        },
                      + {
                          + Action   = [
                              + "secretsmanager:GetSecretValue",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:secretsmanager:us-east-1:245339368379:secret:db-creds-hdEvmn"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "3941968502260631568" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6508a69dc9fa6b1097305a243ec4f452" -> "7e2b9cede07eb34c7d16eb60dc2a8f62"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "8677901282653917602" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6508a69dc9fa6b1097305a243ec4f452" -> "7e2b9cede07eb34c7d16eb60dc2a8f62"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "7096115813722568909" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6508a69dc9fa6b1097305a243ec4f452" -> "7e2b9cede07eb34c7d16eb60dc2a8f62"
        }
    }

Plan: 4 to add, 2 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson